t = ['зошит', 'ручка', 'підручник', 'гумка', 'олівець', 'стікери', 'лінійка'] 
p = {a: b for (a,b) in zip(t, ['Іванов', 'Саган', 'Іванов', 'Тищенко', 'Коломієць', 'Іванов', 'Саган'])}
k = {a: b for (a,b) in zip(t, [5, 12, 2, 4, 7, 4, 1])}
z = {a: b for (a,b) in zip(t, [4.25, 1.5, 150, 0.5, 10.0, 7.25, 2.25])}
d = {a: b for (a,b) in zip(t, ['10.11.2019', '11.11.2019', '10.11.2019', '12.11.2019', '13.11.2019', '13.11.2013', '10.11.2019'])}

list = []
for i in t: 
    if p[i] == 'Іванов':
        list.append(z[i])
        print(f'{i}: кількість - {k[i]} шт, ціна - {z[i]} грн/шт, всього - {z[i]*k[i]} грн, дата продажу - {d[i]}')

for i in t:
    if z[i] == max(list):
        print(f'Товар з максимальною ціною це {i} - {z[i]} грн за шт')